shoppingList/app/views/recipes/new.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
    <%= link_to "Destroy", recipe_path(@recipe), data: {
                      :recipe => @recipes.find(params[:recipe_id]),
                      turbo_method: :delete,
                      turbo_confirm: "Are you sure?"