shoppingList/app/controllers/home_controller.rb

  def menu
    @recipes = Recipe.all # get all recipes
---
SELECT "recipes".* FROM "recipes"