shoppingList/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def new
    @ingredient = Ingredient.new # create
    @ingredients = Ingredient.all # get all ingredients

INSERT INTO "ingredients" ("item", "amount", "unit", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item", "eggs"], ["amount", "1"], ["unit", "dozen"], ["recipe_id", nil], ["created_at", "2022-10-18 00:09:11.401319"], ["updated_at", "2022-10-18 00:09:11.401319"]]
---
  def create
    @ingredient = Ingredient.new(ingredients_params)
    if @ingredient.save # save into sql

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 44]]
---
  def show
    if(params[:id] != nil)
      id = params[:id]
      @ingredient = Ingredient.all.find(id)
    else
      @ingredient = Ingredient.new
    end
    recipe_id = @ingredient.recipe_id
    @ingredient.destroy