shoppingList/app/controllers/recipe_controller.rb

  def new
    @recipe = Recipe.new # create
    @recipes = Recipe.all # get all students
---
SELECT "recipes".* FROM "recipes"