shoppingList/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "instructions" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Edit"], ["instructions", "This is an edited thing"], ["updated_at", "2022-11-12 19:30:13.846288"], ["id", 23]]
INSERT INTO "recipes" ("name", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["instructions", nil], ["created_at", "2022-11-12 19:17:54.906371"], ["updated_at", "2022-11-12 19:17:54.906371"]]
---
  def create
    if(recipe_params[:recipe_id] != nil)
      id = recipe_params[:recipe_id]
      @recipe = Recipe.all.find(id)
      @recipe.name = recipe_params[:name]
      @recipe.instructions = recipe_params[:instructions]
      @recipe.save
    else
      @recipe = Recipe.new(:name => recipe_params[:name], :instructions => recipe_params[:instructions])
      if @recipe.save # save into sql

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" IS NULL
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 29]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 28]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 18]]
---
  def show
    if(params[:id] != nil)
      id = params[:id]
      @recipe = Recipe.all.find(id)
      @ingredients = Ingredient.where(recipe_id: params[:recipe_id]).all
    else
      @recipe = Recipe.new
      @ingredients = Ingredient.new
    end
    @ingredients.destroy_all
    @recipe.destroy