shoppingList/app/controllers/shopping_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def list
    @ingredients = Ingredient.all # get all ingredients