shoppingList/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def new
    @student = Student.new # create
    @students = Student.all # get all students

INSERT INTO "students" ("firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["firstname", "Joseph"], ["lastname", "Faulkner"], ["created_at", "2022-10-16 19:03:12.383168"], ["updated_at", "2022-10-16 19:03:12.383168"]]
---
  def create
    @student = Student.new(student_params)
    if @student.save # save into sql